MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_timer0.c
    if (Tim0_ChannelA == enCh)
    {
        pstcTim0Reg->CMPAR = (uint32_t)u16Cnt;
        AsyncDelay(pstcTim0Reg, enCh, Disable);
        while (u16Cnt != (uint16_t)pstcTim0Reg->CMPAR)
        {
            if (u32TimeOut++ > TIMER0_TMOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }
    }
    else
    {
        pstcTim0Reg->CMPBR = (uint32_t)u16Cnt;
        AsyncDelay(pstcTim0Reg, enCh, Disable);
        while (u16Cnt != (uint16_t)pstcTim0Reg->CMPBR)
        {
            if (u32TimeOut++ > TIMER0_TMOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }
    }
    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Timer0 peripheral base function initialize
 **
 ** \param [in] pstcTim0Reg     Pointer to Timer0 register
 **
 ** \param [in] enCh            Timer0 channel, Tim0_ChannelA or Tim0_ChannelB
 **
 ** \param [in] pstcBaseInit    Timer0 function base parameter structure
 **
 ** \retval Ok                      Process finished.
 ** \retval ErrorInvalidParameter   Parameter error.
 ** \retval ErrorTimeout            Process timeout
 **
 ******************************************************************************/
en_result_t TIMER0_BaseInit(M4_TMR0_TypeDef *pstcTim0Reg, en_tim0_channel_t enCh,
                            const stc_tim0_base_init_t *pstcBaseInit)
{
    stc_tmr0_bconr_field_t stcBconrTmp;
    en_result_t enRet = Ok;
    uint32_t u32TimeOut = 0ul;

    if (NULL != pstcBaseInit)
    {
        DDL_ASSERT(IS_VALID_UNIT(pstcTim0Reg));
        DDL_ASSERT(IS_VALID_CHANNEL(enCh));
        DDL_ASSERT(IS_VALID_CLK_DIVISION(pstcBaseInit->Tim0_ClockDivision));
        DDL_ASSERT(IS_VALID_CLK_SYN_SRC(pstcBaseInit->Tim0_SyncClockSource));
        DDL_ASSERT(IS_VALID_CLK_ASYN_SRC(pstcBaseInit->Tim0_AsyncClockSource));
        DDL_ASSERT(IS_VALID_CLK_MODE(pstcBaseInit->Tim0_CounterMode));

        if ((M4_TMR01 == pstcTim0Reg) && (Tim0_ChannelA == enCh))
        {
            DDL_ASSERT(IS_VALID_CLK_MODE_UNIT01(pstcBaseInit->Tim0_CounterMode));
        }

        /*Read current BCONR register */
        stcBconrTmp = pstcTim0Reg->BCONR_f;
        /* Clear current configurate CH */
        if (Tim0_ChannelA == enCh)
        {
            *(uint32_t *)&stcBconrTmp &= 0xFFFF0000ul;
        }
        else
        {
            *(uint32_t *)&stcBconrTmp &= 0x0000FFFFul;
        }
        pstcTim0Reg->BCONR_f = stcBconrTmp;
        AsyncDelay(pstcTim0Reg, enCh, Enable);
        while (*(uint32_t *)&stcBconrTmp != *(uint32_t *)&(pstcTim0Reg->BCONR_f))
        {
            if (u32TimeOut++ > TIMER0_TMOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }

        switch (enCh)
        {
        case Tim0_ChannelA:

            switch (pstcBaseInit->Tim0_CounterMode)
            {
            case Tim0_Sync:
                stcBconrTmp.SYNCLKA = pstcBaseInit->Tim0_SyncClockSource;
                break;
            case Tim0_Async:
                stcBconrTmp.ASYNCLKA = pstcBaseInit->Tim0_AsyncClockSource;
                break;
            default:
                break;
            }
            /*set clock division*/
            stcBconrTmp.CKDIVA = pstcBaseInit->Tim0_ClockDivision;
            /* Write BCONR register */
            pstcTim0Reg->BCONR_f = stcBconrTmp;
            AsyncDelay(pstcTim0Reg, enCh, Enable);

            /*set timer compare value*/
            pstcTim0Reg->CMPAR = pstcBaseInit->Tim0_CmpValue;
            AsyncDelay(pstcTim0Reg, enCh, Enable);

            /*set timer counter mode*/
            pstcTim0Reg->BCONR_f.SYNSA = pstcBaseInit->Tim0_CounterMode;
            AsyncDelay(pstcTim0Reg, enCh, Enable);
            u32TimeOut = 0ul;
            while (pstcBaseInit->Tim0_CounterMode != pstcTim0Reg->BCONR_f.SYNSA)
            {
                if (u32TimeOut++ > TIMER0_TMOUT)
                {
                    enRet = ErrorTimeout;
                    break;
                }
            }

            break;

        case Tim0_ChannelB:
            switch (pstcBaseInit->Tim0_CounterMode)
            {
            case Tim0_Sync:
                stcBconrTmp.SYNCLKB = pstcBaseInit->Tim0_SyncClockSource;
                break;
            case Tim0_Async:
                stcBconrTmp.ASYNCLKB = pstcBaseInit->Tim0_AsyncClockSource;
                break;
            default:
                break;
            }
            /*set clock division*/
            stcBconrTmp.CKDIVB = pstcBaseInit->Tim0_ClockDivision;
            /* Write BCONR register */
            pstcTim0Reg->BCONR_f = stcBconrTmp;
            AsyncDelay(pstcTim0Reg, enCh, Enable);

            /*set timer compare value*/
            pstcTim0Reg->CMPBR = pstcBaseInit->Tim0_CmpValue;
            AsyncDelay(pstcTim0Reg, enCh, Enable);

            /*set timer counter mode*/
            pstcTim0Reg->BCONR_f.SYNSB = pstcBaseInit->Tim0_CounterMode;
            AsyncDelay(pstcTim0Reg, enCh, Enable);
            u32TimeOut = 0ul;
            while (pstcBaseInit->Tim0_CounterMode != pstcTim0Reg->BCONR_f.SYNSB)
            {
                if (u32TimeOut++ > TIMER0_TMOUT)
                {
                    enRet = ErrorTimeout;
                    break;
                }
            }
            break;

        default:
            break;
        }
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Timer0 peripheral base function initalize
 **
 ** \param [in] pstcTim0Reg     Pointer to Timer0 register
 **
 ** \param [in] enCh            Timer0 channel, Tim0_ChannelA or Tim0_ChannelB
 **
 ** \retval Ok                  Process finished.
 ** \retval ErrorTimeout        Process timeout
 **
 ******************************************************************************/
en_result_t TIMER0_DeInit(M4_TMR0_TypeDef *pstcTim0Reg, en_tim0_channel_t enCh)
{
    en_result_t enRet = Ok;
    uint32_t u32TimeOut = 0ul;

