MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_timer0.c
    DDL_ASSERT(IS_VALID_UNIT(pstcTim0Reg));
    DDL_ASSERT(IS_VALID_CHANNEL(enCh));

    switch (enCh)
    {
    case Tim0_ChannelA:
        pstcTim0Reg->BCONR &= 0xFFFF0000ul;
        AsyncDelay(pstcTim0Reg, enCh, Enable);
        while (0ul != (pstcTim0Reg->BCONR & 0x0000FFFFul))
        {
            if (u32TimeOut++ > TIMER0_TMOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }

        pstcTim0Reg->CMPAR = 0x0000FFFFul;
        pstcTim0Reg->CNTAR = 0x00000000ul;
        pstcTim0Reg->STFLR_f.CMAF = 0u;
        break;

    case Tim0_ChannelB:
        pstcTim0Reg->BCONR &= 0x0000FFFFul;
        AsyncDelay(pstcTim0Reg, enCh, Enable);
        while (0ul != (pstcTim0Reg->BCONR & 0xFFFF0000ul))
        {
            if (u32TimeOut++ > TIMER0_TMOUT)
            {
                enRet = ErrorTimeout;
                break;
            }
        }

        pstcTim0Reg->CMPBR = 0x0000FFFFul;
        pstcTim0Reg->CNTBR = 0x00000000ul;
        pstcTim0Reg->STFLR_f.CMBF = 0u;
        break;
    default:
        break;
    }
    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Set external trigger source for Timer0
 **
 ** \param [in] enEvent         External event source
 **
 ** \retval None
 **
 ******************************************************************************/
void TIMER0_SetTriggerSrc(en_event_src_t enEvent)
{
    DDL_ASSERT(IS_VALID_TRIG_SRC_EVENT(enEvent));

    M4_AOS->TMR0_HTSSR_f.TRGSEL = enEvent;
}

/**
 *******************************************************************************
 ** \brief  Timer0 hardware trigger function initalize
 **
 ** \param [in] pstcTim0Reg     Pointer to Timer0 register
 **
 ** \param [in] enCh            Timer0 channel, Tim0_ChannelA or Tim0_ChannelB
 **
 ** \param [in] pStcInit        Timer0 hareware trigger function structure
 **
 ** \retval Ok                      Process finished.
 ** \retval ErrorInvalidParameter   Parameter error.
 **
 ******************************************************************************/
en_result_t TIMER0_HardTriggerInit(M4_TMR0_TypeDef *pstcTim0Reg, en_tim0_channel_t enCh,
                                   const stc_tim0_trigger_init_t *pStcInit)
{
    stc_tmr0_bconr_field_t stcBconrTmp;
    en_result_t enRet = Ok;

    if (NULL != pStcInit)
    {
        DDL_ASSERT(IS_VALID_UNIT(pstcTim0Reg));
        DDL_ASSERT(IS_VALID_CHANNEL(enCh));
        DDL_ASSERT(IS_VALID_FUNCTION(pStcInit->Tim0_OCMode));
        DDL_ASSERT(IS_VALID_TRIG_SRC_EVENT(pStcInit->Tim0_SelTrigSrc));

        /*Read current BCONR register */
        stcBconrTmp = pstcTim0Reg->BCONR_f;

        switch (enCh)
        {
        case Tim0_ChannelA:
            /*set work on input captrue or output capare*/
            stcBconrTmp.CAPMDA = pStcInit->Tim0_OCMode;
            /*enable input capture*/
            stcBconrTmp.HICPA = pStcInit->Tim0_InTrigEnable;
            /*enable trigger clear counter*/
            stcBconrTmp.HCLEA = pStcInit->Tim0_InTrigClear;
            /*enable trigger start counter*/
            stcBconrTmp.HSTAA = pStcInit->Tim0_InTrigStart;
            /*enable trigger stop counter*/
            stcBconrTmp.HSTPA = pStcInit->Tim0_InTrigStop;

            /* Write BCONR register */
            pstcTim0Reg->BCONR_f = stcBconrTmp;
            break;
        case Tim0_ChannelB:
            /*set work on input captrue or output capare*/
            stcBconrTmp.CAPMDB = pStcInit->Tim0_OCMode;
            /*enable input capture*/
            stcBconrTmp.HICPB = pStcInit->Tim0_InTrigEnable;
            /*enable trigger clear counter*/
            stcBconrTmp.HCLEB = pStcInit->Tim0_InTrigClear;
            /*enable trigger start counter*/
            stcBconrTmp.HSTAB = pStcInit->Tim0_InTrigStart;
            /*enable trigger stop counter*/
            stcBconrTmp.HSTPB = pStcInit->Tim0_InTrigStop;

            /* Write BCONR register */
            pstcTim0Reg->BCONR_f = stcBconrTmp;
            break;
        default:
            break;
        }
        AsyncDelay(pstcTim0Reg, enCh, Enable);

        /* Set trigger source*/
        M4_AOS->TMR0_HTSSR_f.TRGSEL = pStcInit->Tim0_SelTrigSrc;
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

//@} // Timer0Group

#endif /* DDL_TIMER0_ENABLE */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
